Tekla Open API Reference for Tekla Structures 2025
CustomObservableCollection<T> Constructor
 CustomObservableCollection constructor.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CustomObservableCollection()
Public Sub New
See Also
Reference
CustomObservableCollection<T> Class
CustomObservableCollection<T> Overload
Tekla.Structures.Dialog.UIControls Namespace